app/views/messages/_message.html.erb

    <% if message.body %>
        <% user = User.find(message.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]