app/views/messages/_receiver.html.erb

  <% if message.body %>
      <% user = User.find(message.user.id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]