app/views/profiles/_form.html.erb

SELECT "characteristics".* FROM "characteristics" WHERE "characteristics"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
    <h5>Mental Health Disorder</h5>
    <%= f.collection_check_boxes :characteristic_ids, Characteristic.find((1..10).to_a), :id, :name do |b| %>