app/views/profiles/_search_form.html.erb

SELECT  "characteristics".* FROM "characteristics" WHERE (id > 0) LIMIT 10
---
      <div class="filter-box-scroll">
        <%= f.collection_check_boxes :characteristics_id_in_any, Characteristic.where('id > 0').limit(10), :id, :name do |b| %>