app/views/profiles/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---

                        <% if current_user.requested_friendships.include? profile.user %>