app/views/profiles/show.html.erb

        <h4><strong>Characteristics</strong></h4>
        <% @profile.characteristics.each do |characteristic| %>
---
SELECT "characteristics".* FROM "characteristics" INNER JOIN "characteristics_profiles" ON "characteristics"."id" = "characteristics_profiles"."characteristic_id" WHERE "characteristics_profiles"."profile_id" = ?  [["profile_id", 1]]