app/controllers/application_controller.rb

  def toggle_appear_offline
    current_user.toggle_appear_offline if current_user
---
UPDATE "users" SET "appear_offline" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["appear_offline", "t"], ["updated_at", "2016-06-13 21:29:22.169966"], ["id", 1]]