app/controllers/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '3' AND conversations.recipient_id ='4') OR (conversations.sender_id = '4' AND conversations.recipient_id ='3'))  ORDER BY "conversations"."id" ASC LIMIT 1
SELECT  1 AS one FROM "conversations" WHERE ("conversations"."sender_id" = 4 AND "conversations"."recipient_id" = 3) LIMIT 1
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 4], ["recipient_id", 3], ["created_at", "2016-06-14 21:10:37.216092"], ["updated_at", "2016-06-14 21:10:37.216092"]]
---
  def create
    if Conversation.between(params[:sender_id], params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id], params[:recipient_id]).first
    else
      @conversation = Conversation.create!(conversation_params)