app/controllers/friendships_controller.rb

  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id], approved: "false")
    if @friendship.save
---
INSERT INTO "friendships" ("friend_id", "approved", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["friend_id", 4], ["approved", "f"], ["user_id", 3], ["created_at", "2016-06-14 21:09:12.942697"], ["updated_at", "2016-06-14 21:09:12.942697"]]

  def update
    @friendship = Friendship.where(friend_id: current_user, user_id: params[:id]).first
    @friendship.update(approved: true)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."friend_id" = 4  ORDER BY "friendships"."id" ASC LIMIT 1  [["user_id", 3]]
UPDATE "friendships" SET "approved" = ?, "updated_at" = ? WHERE "friendships"."id" = ?  [["approved", "t"], ["updated_at", "2016-06-14 21:10:28.119017"], ["id", 1]]
UPDATE "users" SET "updated_at" = '2016-06-14 21:10:28.326783' WHERE "users"."id" = ?  [["id", 4]]