app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
  def index
    @messages = @conversation.messages

    if @messages.length==0
      @last_user = nil
    else
      @last_user = @messages[@messages.length-1].user

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
INSERT INTO "messages" ("body", "user_id", "conversation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "Hey"], ["user_id", 4], ["conversation_id", 1], ["created_at", "2016-06-14 21:10:46.521982"], ["updated_at", "2016-06-14 21:10:46.521982"]]
---
  def create
    respond_to do |format|
      @message = @conversation.messages.new(message_params)
      @conversation.update_time
      @message.user.try(:touch)
      @messages = @conversation.messages

      if @messages.length == 0
        @last_user = nil
      else
        @last_user = @messages[@messages.length-2].user
      end
      if @messages.length > 10
        @over_ten = true
      end
      if params[:m]
        @over_ten = false
        @messages = @conversation.messages
      end
      if @messages.last
        if @messages.last.user_id != current_user.id
          @messages.last.read = true;
        else
          @message.notify_user(@conversation.get_other_user(current_user))
        end
      end
      if !@message.save