app/controllers/profiles_controller.rb

  def show
    @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @profile = Profile.find(current_user.id)# changed from (params[:id]) because no one needs to edit anyone else's profile
    if params[:edit_hours]
      render 'edit_hours'
    end
    # prevent other users from editing profile
    unless current_user.id == @profile.id
      flash[:notice] = "You can not access this."
      redirect_to root_path
    end
    current_user.update(done_tut_filter: @doneTutFilter) #TODO: how to get the tutorial filter to go away
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "updated_at" = '2016-06-14 22:18:48.942955' WHERE "users"."id" = ?  [["id", 4]]

  def update
    puts "update"
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "class_rank" = ?, "socioeconomic_status" = ?, "living_situation" = ?, "sexual_orientation" = ?, "comfort_with_sexuality" = ?, "is_first_generation_college_student" = ?, "is_physically_disabled" = ?, "is_parent" = ?, "is_single_parent" = ?, "is_from_foster_care" = ?, "is_intercollegiate_athlete" = ?, "is_military" = ?, "is_out_of_state_student" = ?, "is_international_student" = ?, "is_transfer_student" = ?, "updated_at" = ? WHERE "profiles"."id" = ?

    def set_profile
      puts "here"
      @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 4]]